; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-6-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-3 - location
	p1-4 - location
	p3-0 - location
	p3-2 - location
	p4-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s4)
	(at driver5 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s1)
	(at package2 s3)
	(at package3 s3)
	(at package4 s4)
	(at package5 s2)
	(at package6 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 65)
	(= (time-to-walk p0-1 s0) 65)
	(= (time-to-walk s1 p0-1) 69)
	(= (time-to-walk p0-1 s1) 69)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 69)
	(= (time-to-walk p0-3 s0) 69)
	(= (time-to-walk s3 p0-3) 58)
	(= (time-to-walk p0-3 s3) 58)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 60)
	(= (time-to-walk p1-4 s1) 60)
	(= (time-to-walk s4 p1-4) 25)
	(= (time-to-walk p1-4 s4) 25)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 67)
	(= (time-to-walk p3-2 s3) 67)
	(= (time-to-walk s2 p3-2) 48)
	(= (time-to-walk p3-2 s2) 48)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 92)
	(= (time-to-walk p4-2 s4) 92)
	(= (time-to-walk s2 p4-2) 52)
	(= (time-to-walk p4-2 s2) 52)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 62)
	(= (time-to-drive s2 s0) 62)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 54)
	(= (time-to-drive s0 s1) 54)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 3)
	(= (time-to-drive s3 s1) 3)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 97)
	(= (time-to-drive s1 s2) 97)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 36)
	(= (time-to-drive s3 s2) 36)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 34)
	(= (time-to-drive s4 s3) 34)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 76)
	(= (time-to-drive s0 s4) 76)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 26)
	(= (time-to-drive s1 s4) 26)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 41)
	(= (time-to-drive s2 s4) 41)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s3)
	(at driver5 s3)
	(at truck1 s0)
	(at truck2 s2)
	(at truck3 s1)
	(at truck5 s3)
	(at truck6 s3)
	(at package1 s4)
	(at package2 s4)
	(at package3 s4)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (load-truck package1 truck1 s1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 1 of 14
2. (board-truck driver5 truck1 s1)
   deleted: (at driver5 s1) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 1 of 14
3. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   changed: (walked) from 0 to 69
   goals met: 1 of 14
4. (board-truck driver2 truck6 s0)
   deleted: (at driver2 s0) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 1 of 14
5. (drive-truck truck6 s0 s2 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   changed: (driven) from 0 to 62
   goals met: 1 of 14
6. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   changed: (walked) from 69 to 127
   goals met: 2 of 14
7. (board-truck driver4 truck5 s4)
   deleted: (at driver4 s4) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 2 of 14
8. (drive-truck truck5 s4 s3 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (driven) from 62 to 96
   goals met: 3 of 14
9. (drive-truck truck1 s1 s4 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 96 to 122
   goals met: 3 of 14
10. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   goals met: 4 of 14
11. (load-truck package5 truck6 s2)
   deleted: (at package5 s2)
   added: (in package5 truck6)
   goals met: 4 of 14
12. (load-truck package2 truck5 s3)
   deleted: (at package2 s3)
   added: (in package2 truck5)
   goals met: 4 of 14
13. (load-truck package3 truck5 s3)
   deleted: (at package3 s3)
   added: (in package3 truck5)
   goals met: 4 of 14
14. (load-truck package4 truck1 s4)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 4 of 14
15. (drive-truck truck1 s4 s0 driver5)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 122 to 198
   goals met: 5 of 14
16. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 6 of 14
17. (disembark-truck driver5 truck1 s0)
   deleted: (driving driver5 truck1)
   added: (at driver5 s0) (empty truck1)
   goals met: 6 of 14
18. (walk driver5 s0 p0-3)
   deleted: (at driver5 s0)
   added: (at driver5 p0-3)
   changed: (walked) from 127 to 196
   goals met: 6 of 14
19. (walk driver5 p0-3 s3)
   deleted: (at driver5 p0-3)
   added: (at driver5 s3)
   changed: (walked) from 196 to 254
   goals met: 7 of 14
20. (drive-truck truck6 s2 s3 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (driven) from 198 to 234
   goals met: 8 of 14
21. (board-truck driver5 truck2 s3)
   deleted: (at driver5 s3) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 7 of 14
22. (drive-truck truck2 s3 s2 driver5)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 234 to 270
   goals met: 8 of 14
23. (disembark-truck driver5 truck2 s2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s2) (empty truck2)
   goals met: 8 of 14
24. (drive-truck truck5 s3 s4 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   changed: (driven) from 270 to 304
   goals met: 7 of 14
25. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   goals met: 8 of 14
26. (unload-truck package3 truck5 s4)
   deleted: (in package3 truck5)
   added: (at package3 s4)
   goals met: 9 of 14
27. (drive-truck truck5 s4 s3 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (driven) from 304 to 338
   goals met: 10 of 14
28. (drive-truck truck6 s3 s1 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   changed: (driven) from 338 to 341
   goals met: 9 of 14
29. (unload-truck package5 truck6 s1)
   deleted: (in package5 truck6)
   added: (at package5 s1)
   goals met: 10 of 14
30. (drive-truck truck6 s1 s3 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s3)
   changed: (driven) from 341 to 344
   goals met: 11 of 14
31. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 12 of 14
32. (walk driver5 s2 p3-2)
   deleted: (at driver5 s2)
   added: (at driver5 p3-2)
   changed: (walked) from 254 to 302
   goals met: 12 of 14
33. (walk driver5 p3-2 s3)
   deleted: (at driver5 p3-2)
   added: (at driver5 s3)
   changed: (walked) from 302 to 369
   goals met: 13 of 14
34. (walk driver1 s4 p4-2)
   deleted: (at driver1 s4)
   added: (at driver1 p4-2)
   changed: (walked) from 369 to 461
   goals met: 13 of 14
35. (walk driver1 p4-2 s2)
   deleted: (at driver1 p4-2)
   added: (at driver1 s2)
   changed: (walked) from 461 to 513
   goals met: 13 of 14
36. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 13 of 14
37. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 344 to 441
   goals met: 14 of 14
